# St7SetReinforcementName

Sets the name of the specified concrete reinforcement layout.

long St7SetReinforcementName(long uID, long LayoutID, char* LayoutName)

Input Parameters

uID

Strand7 model file ID.

LayoutID

Reinforcement layout ID.

LayoutName

Name of the layout.